{
  "downloads": [
    {
      "name":"WoW Auction Helper",
      "slug": "wah",
      "status":"On hold",
      "type":"Desktop application",
      "summary": "World of Warcraft Auction Helper is  application that allows you to get a better overview over what items is worth investing in at your local auctionhouse. The application uses pre-defined filters to calculate the production cost of an item and the profit based on the cheapest current auction of that item. The data used to get demand is fetched from wowuction. You can also set up your own \"watch list\" filter, and there is a filter that shows what items that has a min price lower than the market price. For more info on how to set the application up for use if you need help, go to the \"how to\" section for this application  in the application menu.",
      "text":"<h3>What the application does:</h3>The application uses data from wowuction, to calculate what's profitable to make and what's not. The blizzard API is used to know what auctions you have up on the auction house, and is used to show you whom have undercutted you and how much your auctions are worth.In the main window you'll see three tales (unless you have chosen to have fewer). The one on the left is for the filtered auctions, meaning those that either are based on your filter or the pre-defined ones. The two other tables are the data from wowuction (new updates around ever hour or so) and directly from blizzards API (new update available every 15 minutes or so). You can search for text in any of the columns in the table.Using these two together, allows you to easily find out what items you already have at the auction house, so that you know what you need to make more of (and what you don't). So there is no more a need of checking your auctioneer every time, you wonder if there is something you already have up at the auction house.<strong>You have 9 pre-defined filters that you can use to find the potential profit of an item:</strong><em>Currently there are just Warlords of Draenor recipes implemented in the application(the exception is the glyphs).</em><ul><li>Gear (Blacksmithing, Jewelcrafting, Tailoring, Leatherworking)</li><li>Gems (both blue and green ones)</li><li>Enchants (All Warlords of Draenor Recepies should have been added)</li><li>Consumables(Cooking &amp; Alchemy)</li><li>Glyphs (All glyphs)<ul><li>You can choose if you wish to buy all the herbs and mill them, just get warbinders ink and turn them into the materials needed or if you just want to buy the inks form the auction house.</li></ul></li><li>Crafted materials (Currently just WoD materials, but more is coming)</li><li>Items that are cheaper than the market price.</li></ul>These prices are calculated with the assumption that you buy every non soulbound item, from the auction house.The dailie materials's prices are calculated based on what it actually costs to make them (raw materials). Please, do not post such items too cheap(even if it is profitable for you to post them cheap)... The daily cooldown in it self, should be worth a couple extra gold.",
      "requirements": [
        "A computer", "Java Runtime", "WoWuction API key"
      ],
      "video":[{"url":""}],
      "images":[
        {
          "src": "img/wah/owner-stats.jpg",
          "alt": "",
          "caption": ""
        },{
          "src": "img/wah/watchlist.png",
          "alt": "",
          "caption": ""
        },{
          "src": "img/wah/changelog2.png",
          "alt": "",
          "caption": ""
        },{
          "src": "img/wah/setup_WAH.png",
          "alt": "",
          "caption": ""
        },{
          "src": "img/wah/tradingpost.jpg",
          "alt": "",
          "caption": ""
        },{
          "src": "img/wah/workorders.jpg",
          "alt": "",
          "caption": ""
        },{
          "src": "img/wah/overlay.jpg",
          "alt": "",
          "caption": ""
        },{
          "src": "img/wah/filtered-auc.jpg",
          "alt": "",
          "caption": ""
        },{
          "src": "img/wah/undercutted-by.jpg",
          "alt": "",
          "caption": ""
        },{
          "src": "img/wah/my-auctions.jpg",
          "alt": "",
          "caption": ""
        },{
          "src": "img/wah/o-stats.jpg",
          "alt": "",
          "caption": ""
        },{
          "src": "img/wah/cod-calc.jpg",
          "alt": "",
          "caption": ""
        },{
          "src": "img/wah/glyph-edit.jpg",
          "alt": "",
          "caption": ""
        },{
          "src": "img/wah/settings-general.jpg",
          "alt": "",
          "caption": ""
        },{
          "src": "img/wah/settings-api.jpg",
          "alt": "",
          "caption": ""
        },{
          "src": "img/wah/blizz-tab.jpg",
          "alt": "",
          "caption": ""
        },{
          "src": "img/wah/tooltip.jpg",
          "alt": "",
          "caption": ""
        }
      ],
      "changelog":[
        {
          "version":"beta 22",
          "date": "4/4-2016",
          "url": [
            {"platform": "Java", "href": ""}
          ],
          "changes":"<ul><li>Changed the numbering of releases as I found it confusing as to what version number would be correct to assign. The version for this release is Beta 22, next would be Beta 23 and so on.</li><li>Fixed a bug, causing the url for blizz API download not to update upon settings update (requiered a reload of the application before)</li><li>Right clicking an item in any of the tabs in the main window, allows you to open the browser at that items wowhead page. This can be useful if you are wondering where an item drops etc.</li><li>Added two new filters:<ul><li>Vendor sold items - This list contains all the items that are sold from vendors that are auctionable, and has \"VENDOR\" as sourcetype in blizzards API. Some items might appear in the list that should not, but that is a bug on blizzards end.</li><li>Dropped items - This list contains all the items that can be dropped and are auctionable, and contains \"DROP\" as sourcetype in blizzards API. Some items might appear in the list that should not, but that is a bug on blizzards end.</li></ul></li><li>The filtered table should no longer bug out if a list comes up empty handed. It will no instead have a placeholder item telling you why it might be empty.</li><li>Known bugs:<ul><li>The filtered table should properly add filtered items if the user does not have any WoWuction data available. However, the blizzard auction tab and tooltips won't work.</li><li>If there is WoWuction data available, the fitlered tab won't work, unless you go to \"file -> force refresh filter list\"</li><li>If there are more bugs that I might not be aware of, please post them in the thread @ stormspire (http://stormspire.net/tools-programs-spreadsheets/16083-wow-auction-helper-java-aka-multiplatform.html).</li></ul></li></ul>"
        },{
          "version":"0.9.9.8",
          "date":"15/3-2016",
          "url": [
            {"platform": "Java", "href": ""}
          ],
          "changes":"<ul><li>A bug, causing some items to get listed with a production cost of 0 should now have been fixed. Do keep in mind that some items might actually not exist at AH, and will then be listed as 0 if that is the case.If it isn't please notify me at the forum.</li><li>The tables should no longer update twice when the application starts up.</li><li>Fixed it so that character names no longer are case-sensitive. The setup wizard sets character names as lowercase, so this should no longer cause problems.</li></ul>"
        },{
          "version":"0.9.9.7.1",
          "date":"15/3-2016",
          "url": [
            {"platform": "Java", "href": ""}
          ],
          "changes":"<ul><li>Fixed a bug in the add material and C.O.D dialog windows, where the item name would not be downloaded automatically.</li><li>The changelog window is now scrollable.</li></ul>"
        },
         {
          "version":"0.9.9.7",
          "date":"14/3-2016",
          "url": [
            {"platform": "Java", "href": ""}
          ],
          "changes":"<ul><li>Imporved the setup wizard for first time users.</li><li>Fixed a problem where the app did not use the new API url paired with a API key.</li><li>The update dialog now shows a changelog.</li><li>The color scheme of the app should now be the same all over the place.</li><li>Some new recepies are added (But not all of them have been assigned to a profession etc).</li></ul>"
         }
      ]
    },{
      "name":"Eatable prototype",
      "slug": "eatable",
      "status":"Completed prototype",
      "type":"Android app",
      "summary": "Here you can see an application that I created during the course \"Android-development\" in the spring of 2016 at the University College of Østfold. During this course we were supposed to come up with a concept for an android application, and develop a prototype for it.",
      "text":"<br><strong>Languages used:</strong> Java, php and mySQL<br><strong>Software used:</strong> Android Studio, PhpStorm and Adobe Experience Design<br><h2>The application</h2><img class=\"wp-image-600 size-medium float-left\" src=\"img/eatable/eatable-logo.png\" alt=\"logo\" width=\"300\" height=\"281\"/>The concept I decided to create a prototype for was a food scanner. The application was named \"Eatable?\".Eatable is a application that allows the user to define a diet that they are following. If they have defined a diet, a scanned product will tell the user if that product is suitable for their diet or not. You can find a video walkthrough of the application below.",
      "requirements": [
        "Android"
      ],
      "images":[],
      "video":[{"url": "https://www.youtube.com/embed/80AsYIiqtJM"}],
      "links":[
        {"name":"GitHub", "href":"https://github.com/ukon1990/Eatable"},
        {"name":"Project site(Norwegian)", "href":"http://frigg.hiof.no/android_v165/"}
      ],
      "changelog":[
        {
          "version":"Prototype Final",
          "date": "29/4-2016",
          "url": [
            {"platform": "Android", "href": "http://frigg.hiof.no/android_v165/delivery/spisbar-release.apk"}
          ],
          "changes":""
        },{
          "version":"Prototype Beta",
          "date": "10/4-2016",
          "url": [
            {"platform": "Android", "href": "http://frigg.hiof.no/android_v165/wp-content/uploads/2016/04/spisbart-beta_v3.apk"}
          ],
          "changes":""
        }
      ]
    },{
      "name":"Vermin run prototype",
      "slug": "vermin-run",
      "status":"Completed",
      "type":"Video game",
      "summary": "First of all, I'd like to point out that this is a <span style=\"text-decoration: underline;\"><strong><em>game prototype</em></strong></span>. This is a game that I created in the course <em>Introduction to game programming</em> at <a href=\"http://www.hiof.no\" target=\"_blank\">Østfold University College</a>(Opens in a new tab). Please do keep in mind, that I have not created all the textures in the game my self. The textures are bought from <a href=\"http://gametextures.com/\" target=\"_blank\">GameTextures.com</a>. If you have not heard of them, and are in need of some awesome PBR (Physically Based Rendering) materials, check them out! Lots of good materials for games there. Some of the models in this game are from World of Warcraft, but I am under the understanding that it was ok to use it, as long as it was nothing commercial and that it is a \"fan\" game. The original intention was to make everything my self, but as I was alone on this project there simply was not time for it (I also did not have any experience with Maya beforehand). If you wish to get a gimps into the project process, feel free to check out the project page (<a href=\"http://frigg.hiof.no/spillprg_v155/\" target=\"_blank\">http://frigg.hiof.no/spillprg_v155/</a>). You can also find the project report there.",
      "text":"<h3>The game</h3> The game is a 3D sidescroller, where the player collects coins and avoid getting killed by enemies. There is no big plot or storyline behind the game. If you either collect all the coins, win the game by not dying more than 6 times (or 5) or complete the game in less than 6 minutes, you unlock the bonus level.<em>You can see a complete playthrough of the game below. Please keep in mind, that I have edited this video to not show all the times I failed. This makes it seem like objects randomly disappear and my health to go up to 100% out of nowhere.</em><h4>Controls</h4> Keyboard Moving around – WASD keys or Arrow keys Jumping – Space button Interaction – The E button PS4 controller Moving around – Left joystick Jumping – The X button Interaction – The Square button<a href=\"img/verin-run/CollectableTest_unity_-_Rabbit_run_-_PC__Mac___Linux_Standalone__Personal_.png\"><img class=\"alignnone size-full wp-image-411\" src=\"http://jonaskf.net/wp-content/uploads/2015/11/CollectableTest_unity_-_Rabbit_run_-_PC__Mac___Linux_Standalone__Personal_.png\" alt=\"CollectableTest_unity_-_Rabbit_run_-_PC__Mac___Linux_Standalone__Personal_\" width=\"1201\" height=\"315\"/></a><h4>Advancing to the next level</h4> To be able to advance to the next level, you need to find a keycard. This keycard opens some of the doors in the level but not all of them.<h4>How do I unlock the bonus level?</h4> You can unlock the bonus level by collecting all the coins, dying less than 6 times or by completing the whole run form level 1 to 3 in less than 6 minutes.<h4>How to kill enemies</h4> To kill an enemy you simply jump on its head. The Robots and the Monkeys take 1 hit, the turtle takes 2 hits.How to get full healthYou can get back to max health either by dying, or collecting a health potion.<h3>Credits</h3> For the credits list, check out the project document page (<a href=\"http://frigg.hiof.no/spillprg_v155/?page_id=38\" target=\"_blank\">http://frigg.hiof.no/spillprg_v155/?page_id=38</a>).",
      "requirements": [
        "Any computer"
      ],
      "images":[],
      "video":[{"url": "https://www.youtube.com/embed/S8Y2vCt25rA"}],
      "changelog":[
        {
          "version":"Prototype Final",
          "date": "5/5-2015",
          "url": [
            {"platform": "Windows", "href": "http://www.ia-stud.hiof.no/~jonaskf/spillprgstuff/Win-Vermin_run.zip"},
            {"platform": "macOS", "href": "http://www.ia-stud.hiof.no/~jonaskf/spillprgstuff/OSX-Vermin_run.zip"},
            {"platform": "Linux", "href": "http://www.ia-stud.hiof.no/~jonaskf/spillprgstuff/Linux-vermin_run.zip"}
          ],
          "changes":"The game is now finalized and ready for delivery."
        },{
          "version":"Prototype RC",
          "date": "27/4-2015",
          "url": [],
          "changes":"<ul><li>All the levels are completed</li><li>Fixed a missing texture in level 2</li><li>Linux version is now up also</li><li>There are a couple bug fixes up, as well as the bonus level is now in the build.</li><li>The UI looks better now (hopefully)<ul><li>Tested at 720p and 1080p</li></ul></li><li>Fixed a bug, causing the image on the starting screen to block the buttons if the resolution isn’t 1080p. wooops…</li><li>Fixed the sound. The world now feels less empty.<ul><li>I’d love to add music too, but I can’t find anything good that isn’t copyrighted. Besides, you have your own music, right?</li></ul></li></ul>"
        },{
          "version":"Prototype Beta",
          "date": "16/4-2015",
          "url": [],
          "changes":"<ul><li>Character<ul><li>New character model (Not created by me.)</li><li>Animation has been added</li><li>The character now actually rotates based on the key/button input<ul><li>Using velocity, so that the script hopefully can be used for enemies also</li></ul></li></ul></li><li>Levels<ul><li>Level 1<ul><li>The elevators now play a sound if they are active.</li><li>The lever don’t have a delay on the animation.<ul><li>And you can’t disable the elevator either.</li></ul></li><li>The keycard now has a texture and rotates slightly.<ul><li>So that it hopefully is more clear, that this is a collectible object</li></ul></li><li>The doors have a indication, that tells you if you can enter them at the given time or not.<ul><li>If they require an object, they will change material/texture&nbsp;when you get that item.</li></ul></li></ul></li><li>Level 2<ul><li>Tried to make the level a bit easier, since some people found it too hard 😛</li><li></li></ul></li></ul></li><li>Added some GUI<ul><li>Start menu<ul><li>Allows you to start from the first level or choose what level you wish to start from</li><li>You can exit the game from this page also</li></ul></li><li>Pause menu<ul><li>Pauses the game</li><li>Menu elements<ul><li>Resume game (you might as well click “esc”, it does the same thing)</li><li>Restart level<ul><li>Starts the level as if you just entered it.</li></ul></li><li>Exit to main menu<ul><li>Sends you to the start menu</li></ul></li><li>Exit game<ul><li>Exits the game</li></ul></li></ul></li></ul></li></ul></li><li>Fixed the bug in the first level, that made it so that the game freezes when you fall in the first area<ul><li>Was due to a silly “bug” on my part.. The death zone did not refer to a prefab.. woops..</li></ul></li></ul>"
        },{
          "version":"Prototype Alpha",
          "date": "28/2-2015",
          "url": [
            {"platform": "Windows", "href": "files/vermin-run/vermin-run-alpha.zip"}
          ],
          "changes":"This version does not contain any enemies (just a couple models that follow you around), a map and a playable character."
        }
      ]
    }
  ]
}
